app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "deadline", "description", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 14 Mar 2012 11:34:23 UTC +00:00], ["deadline", Wed, 14 Mar 2012 11:34:00 UTC +00:00], ["description", ""], ["status", ""], ["updated_at", Wed, 14 Mar 2012 11:34:23 UTC +00:00]]

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "tasks" SET "description" = 'Demo application that i need to build for quipper and submit.', "updated_at" = '2012-03-14 12:26:56.162350' WHERE "tasks"."id" = 6